{"class_name": "Model", "config": {"name": "model_1", "layers": [{"name": "ffwd_inp", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 43], "dtype": "float32", "sparse": false, "name": "ffwd_inp"}, "inbound_nodes": []}, {"name": "ffwd_bn0", "class_name": "BatchNormalization", "config": {"name": "ffwd_bn0", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["ffwd_inp", 0, 0, {}]]]}, {"name": "ffwd_dense1", "class_name": "Dense", "config": {"name": "ffwd_dense1", "trainable": true, "units": 1024, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["ffwd_bn0", 0, 0, {}]]]}, {"name": "ffwd_bn1", "class_name": "BatchNormalization", "config": {"name": "ffwd_bn1", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["ffwd_dense1", 0, 0, {}]]]}, {"name": "ffwd_do1", "class_name": "Dropout", "config": {"name": "ffwd_do1", "trainable": true, "rate": 0.1, "noise_shape": null, "seed": null}, "inbound_nodes": [[["ffwd_bn1", 0, 0, {}]]]}, {"name": "ffwd_act1_lrelu", "class_name": "LeakyReLU", "config": {"name": "ffwd_act1_lrelu", "trainable": true, "alpha": 0.20000000298023224}, "inbound_nodes": [[["ffwd_do1", 0, 0, {}]]]}, {"name": "ffwd_dense2", "class_name": "Dense", "config": {"name": "ffwd_dense2", "trainable": true, "units": 1024, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["ffwd_act1_lrelu", 0, 0, {}]]]}, {"name": "ffwd_bn2", "class_name": "BatchNormalization", "config": {"name": "ffwd_bn2", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["ffwd_dense2", 0, 0, {}]]]}, {"name": "ffwd_do2", "class_name": "Dropout", "config": {"name": "ffwd_do2", "trainable": true, "rate": 0.1, "noise_shape": null, "seed": null}, "inbound_nodes": [[["ffwd_bn2", 0, 0, {}]]]}, {"name": "ffwd_act2_lrelu", "class_name": "LeakyReLU", "config": {"name": "ffwd_act2_lrelu", "trainable": true, "alpha": 0.20000000298023224}, "inbound_nodes": [[["ffwd_do2", 0, 0, {}]]]}, {"name": "ffwd_dense3", "class_name": "Dense", "config": {"name": "ffwd_dense3", "trainable": true, "units": 1024, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["ffwd_act2_lrelu", 0, 0, {}]]]}, {"name": "ffwd_bn3", "class_name": "BatchNormalization", "config": {"name": "ffwd_bn3", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["ffwd_dense3", 0, 0, {}]]]}, {"name": "ffwd_do3", "class_name": "Dropout", "config": {"name": "ffwd_do3", "trainable": true, "rate": 0.1, "noise_shape": null, "seed": null}, "inbound_nodes": [[["ffwd_bn3", 0, 0, {}]]]}, {"name": "ffwd_act3_lrelu", "class_name": "LeakyReLU", "config": {"name": "ffwd_act3_lrelu", "trainable": true, "alpha": 0.20000000298023224}, "inbound_nodes": [[["ffwd_do3", 0, 0, {}]]]}, {"name": "ffwd_dense4", "class_name": "Dense", "config": {"name": "ffwd_dense4", "trainable": true, "units": 512, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["ffwd_act3_lrelu", 0, 0, {}]]]}, {"name": "ffwd_bn4", "class_name": "BatchNormalization", "config": {"name": "ffwd_bn4", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["ffwd_dense4", 0, 0, {}]]]}, {"name": "ffwd_do4", "class_name": "Dropout", "config": {"name": "ffwd_do4", "trainable": true, "rate": 0.1, "noise_shape": null, "seed": null}, "inbound_nodes": [[["ffwd_bn4", 0, 0, {}]]]}, {"name": "ffwd_act4_lrelu", "class_name": "LeakyReLU", "config": {"name": "ffwd_act4_lrelu", "trainable": true, "alpha": 0.20000000298023224}, "inbound_nodes": [[["ffwd_do4", 0, 0, {}]]]}, {"name": "ffwd_dense5", "class_name": "Dense", "config": {"name": "ffwd_dense5", "trainable": true, "units": 256, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["ffwd_act4_lrelu", 0, 0, {}]]]}, {"name": "ffwd_bn5", "class_name": "BatchNormalization", "config": {"name": "ffwd_bn5", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["ffwd_dense5", 0, 0, {}]]]}, {"name": "ffwd_do5", "class_name": "Dropout", "config": {"name": "ffwd_do5", "trainable": true, "rate": 0.1, "noise_shape": null, "seed": null}, "inbound_nodes": [[["ffwd_bn5", 0, 0, {}]]]}, {"name": "ffwd_act5_lrelu", "class_name": "LeakyReLU", "config": {"name": "ffwd_act5_lrelu", "trainable": true, "alpha": 0.20000000298023224}, "inbound_nodes": [[["ffwd_do5", 0, 0, {}]]]}, {"name": "ffwd_dense6", "class_name": "Dense", "config": {"name": "ffwd_dense6", "trainable": true, "units": 128, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["ffwd_act5_lrelu", 0, 0, {}]]]}, {"name": "ffwd_bn6", "class_name": "BatchNormalization", "config": {"name": "ffwd_bn6", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["ffwd_dense6", 0, 0, {}]]]}, {"name": "ffwd_do6", "class_name": "Dropout", "config": {"name": "ffwd_do6", "trainable": true, "rate": 0.1, "noise_shape": null, "seed": null}, "inbound_nodes": [[["ffwd_bn6", 0, 0, {}]]]}, {"name": "ffwd_act6_lrelu", "class_name": "LeakyReLU", "config": {"name": "ffwd_act6_lrelu", "trainable": true, "alpha": 0.20000000298023224}, "inbound_nodes": [[["ffwd_do6", 0, 0, {}]]]}, {"name": "ffwd_out", "class_name": "Dense", "config": {"name": "ffwd_out", "trainable": true, "units": 3, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["ffwd_act6_lrelu", 0, 0, {}]]]}], "input_layers": [["ffwd_inp", 0, 0]], "output_layers": [["ffwd_out", 0, 0]]}, "keras_version": "2.2.4", "backend": "tensorflow"}